Revit 2027 API
Document.ProjectLocations Property
Retrieve all the project locations associated with this project
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ProjectLocationSet ProjectLocations { get; }
Public ReadOnly Property ProjectLocations As ProjectLocationSet
	Get
public:
property ProjectLocationSet^ ProjectLocations {
	ProjectLocationSet^ get ();
}
member ProjectLocations : ProjectLocationSet with get
Property Value
ProjectLocationSet
Remarks
This property returns all the locations of the project. A project can have one site location but many project locations within that site. Each project location object is an offset and rotation from the site location.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace